var res;
//res = confirm("Is Rome the capital of Italy?");
//console.log(res);
if(res)               
{
    //alert("You are right!");
} 
else{
    //alert("You are wrong!");
}





var res1, mark = 0;
//res = confirm("Rome is in Italy?");
if(res1) { mark ++; }    
//res1 = confirm("Film of Harry Potter has 8 parts?");
if(res1) { mark ++; }
//res1 = confirm("Rainbow has 8 colors?");
if(!res1) { mark ++; } 
//res1 = confirm("Is Kiev the capitale or Ukrain?");
if(res1) { mark ++; }
//res1 = confirm("HTML is programing language");
if(!res1) { mark ++; }
//alert("Test is finished. Cuestions: 5. Answers: " + mark);






var age;
//age = prompt("How old are you", 18);
if (age >= 18 && age < 150)
{
  //alert("Yju are an adult");
}
else if (age >= 0 && age < 18)
{
    //alert("You are children");
}














var day, prompt ;
//day = prompt("Enter the day of the week?");
if (day == 1 )
{
  //  alert("Monday");
   
}
if (day == 2 )
{
    
    //alert("Tuesday");
}

if (day == 3 )
{
    //alert("Wedesday");
    
}
if (day == 4 )
{
    
    //alert("Thursday");
}

if (day == 5 )
{
    //alert("Friday");
    
}
if (day == 6 )
{
    
    //alert("Saturday");
}
if (day == 7 )
{
    
    //alert("Sunday");
}
if (day >= 8 || day < 1)
{
   //alert("Error");
}




var res3, prompt ;
res3 = prompt("Enter the planate?");


if (res3 == "Earthe" || res3 == "earthe" ||res3 == "Земля" ||res3 == "земля" )
{
    alert("Земля є найбільшою та найщільнішою серед внутрішніх планет. У Землі є один природний супутник — Місяць, це єдиний великий супутник планет земної групи. Серед планет земної групи Земля є унікальною (насамперед — гідросферою). Атмосфера Землі радикально відрізняється від атмосфер інших планет — вона містить вільний кисень. Питання про наявність життя де-небудь, крім Землі, залишається відкритим.");
   
}
 else if (res3 == "Марс" ||res3 == "марс" || res3 == "Mars"  ||res3 == "mars" )
{
    
    alert("Марс менший за Землю та Венеру (0,107 маси Землі). Він має атмосферу, що складається переважно з вуглекислого газу, з поверхневим тиском 6,1 мбар (0,6 % від земного). На його поверхні є вулкани, найбільший із яких, Олімп, перевищує розмірами всі земні вулкани, досягаючи висоти 21,2 км[48]. Рифтові западини (долини Марінера) свідчать про колишню тектонічну активність. Сучасної тектонічної та вулканічної активності на Марсі не зареєстровано, але, за деякими оцінками, Олімп востаннє вивергався не більше 2 млн років тому[49]. Червоний колір поверхні Марса зумовлений великою кількістю оксиду заліза в його ґрунті. Планета має два супутники — Фобос і Деймос. Припускається, що вони являють собою захоплені астероїди[50].");
}

else if (res3 == "Венера" || res3 == "венера" || res3 == "Venera" || res3 == "venera" )
{
    alert("Венера близька за розміром і масою до Землі (її маса становить 0,815 земної). Як і Земля, вона має потужну атмосферу та товсту силікатну оболонку навколо залізного ядра. На поверхні Венери є яскраві ознаки колишньої геологічної активності, в першу чергу вулканізму. Води в складі Венері майже нема, а її атмосфера в дев'яносто разів щільніша за земну. Це найгарячіша планета: температура її поверхні перевищує 400 °C. Причиною цього є парниковий ефект у щільній, багатій на вуглекислий газ атмосфері[47]. Надійних ознак сучасної ендогенної геологічної активності на Венері не виявлено[джерело?], але, оскільки у неї немає магнітного поля, яке запобігло б виснаженню її наявної атмосфери, це дозволяє припустити, що її атмосфера регулярно поповнюється вулканічними виверженнями. Природних супутників у Венери немає.");
    
}
else if (res =="Меркурій" || res =="меркурій" || res =="Mercury" ||res =="mercury")
{
    
    alert("TМеркурій є найближчою до Сонця (0,4 а.о.) й найменшою планетою системи (0,055 маси Землі). У Меркурія немає супутників, а його найпомітнішими, після ударних кратерів, деталями рельєфу є численні криволінійні уступи довжиною до сотень кілометрів і висотою до 3 км. Ймовірно, вони виникли при стисканні планети внаслідок поступового остигання її надр[45].Меркурій має вкрай розріджену атмосферу. Вона складається з атомів, «вибитих» із поверхні планети сонячним вітром. Велике залізне ядро Меркурія та його тонка кора ще не отримали належного пояснення. Є гіпотеза, яка припускає, що зовнішні шари планети, які складаються з легких елементів, було зірвано внаслідок гігантського зіткнення, яке зменшило розміри планети[46], а також запобігло повному поглинанню Меркурія молодим Сонцем.");
}

else if (res3 == "Юпітер"|| res3 == "юпітер"|| res3 == "Jupiter"|| res3 == "jupiter" )
{
    alert("Friday");
    
}
else if (res3 == "Уран" || res3 == "yран" || res3 == "Uranus" || res3 == "uranus")
{
    
    alert("Saturday");
}
else if (day == 7 )
{
    
    alert("Sunday");
}
else{
   alert("Error");
}

